import 'package:flutter/material.dart';
class AboutTlp extends StatefulWidget {
  const AboutTlp({super.key});

  @override
  State<AboutTlp> createState() => _AboutTlpState();
}

class _AboutTlpState extends State<AboutTlp> {
  bool _customTileExpanded = false;
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(),
      body: SingleChildScrollView(
        child: Column(children:  [
          Directionality(
             textDirection: TextDirection.rtl,
            child: ExpansionTile(
              title:  const Text('تحریک کا تعارف',  style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 15),),
             
              trailing: Icon(
                _customTileExpanded
                    ? Icons.arrow_drop_down_circle
                    : Icons.arrow_drop_down,
                    textDirection: TextDirection.rtl,
              ),
              children: const <Widget>[
                ListTile(title: Padding(
                  padding: EdgeInsets.all(8.0),
                  child: Text('تحریکِ لبیک پاکستان (ٹی ایل پی) ایک پاکستانی سیاسی جماعت ہے، جو تحریک لبیک یا رسول اللہ صلی اللہ علیہ وآلہ وسلم نامی جماعت کے سربراہ امیر المجاہدین ،حافظِ قُرآن وأحادیثِ طَوِیلہ وکثیرہ وحَدائِقِ بَخشِش ورُومِیات وإقبالیات وشَیرازِیات بابا جی  خادم حسین رضوی رحمتہ اللہ علیہ کی زیر قیادت قائم ہوئی۔ 26جولائی 2017ء کو الیکشن کمیشن آف  پاکستان میں رجسٹرڈ  ہوئی اور اس تنظیم کو کرین کا انتخابی نشان دیا گیا۔موجودہ امیر جانشین امیر المجاہدین علامہ سعد حسین رضوی دامت برکاتہم العالیہ ہیں۔ ٹی ایل پی پاکستان کے بھرے سیاسی بازار میں ایک نئی شمولیت ہے، پاکستان تو پاکستان اس تحریک نے دنیا بھر میں یہ توجہ مبذول کروائی  کہ ختم نبوت اور ناموس رسالت ایک حساس مسئلہ ہے اس مسئلہ کی حساسیت کو سمجھیں یہ ہمارے دین اسلام کی اساس ہے۔پچھلے چندسال کے قلیل عرصہ میں، ٹی ایل پی نے پاکستان میں دو منتخب حکومتوں کو اپنے نظریے کی قانونی حیثیت کو قبول کرنے پر مجبور کیا۔اور باور کروایا کہ ہمارا نظریہ وہی ہے جو بانیان پاکستان علامہ محمد اقبال اور محمد علی جناح کے پاکستان کا نظریہ ہے۔ یعنی پاکستان کا مطلب کیا ۔؟ لا الہ الااللہ ،    دستور ریاست کیا ہوگا۔؟محمد رسول اللہ۔ٹی ایل پی کی آمد کے بعد  گلی گلی، نگر نگر ،گوشہ گوشہ، یہ نعرہ عام ہوا ، لبیک لبیک لبیک یا رسول اللہ ۔تاجدار ِختم نبوت زندہ باد ،زندہ باد،زندہ باد۔من سب نبیاََ فقتلوہ۔گستاخ رسول کی ایک سزا سر تن سے جدا ،سرتن سے جدا۔یہی وجہ ہےکہ اغیار تو اغیار اپنے آپ کوعاشق رسول کہنے والےاغیار کے آلہ کار ملک کے بعض  مذہبی ،سیاسی،سماجی، سویلین اور عسکری رہنماؤں نے بھی ٹی ایل پی اور اس کے نظریے سے نمٹنے کے لیے ایک مربوط حکمت عملی کے تحت اسے کلعدم قرار دے دیا،اس کے افعال کودہشتگردی سے تعبیر کیا،دشمن کا ایجنٹ کہا،اور اپنے تئیں اسے سیاسی منظر نامے سے باہر نکالنے کی غرض سے بھرپور جدوجہد کی لیکن پاکستان کی تاریخ میں پہلی مرتبہ ایسا ہوا کہ کسی سیاسی جماعت کوکلعدم قرار دیا گیا ہو اور پھر دوبارہ اس کا سٹیٹس بحال کیا ہو۔ یہ محض اللہ تعالیٰ کے فضل و کرم ، نبی پاک شاہ لولاک صلی اللہ علیہ وسلم کی نظر رحمت ، شہداء ِختم نبوت اور ناموس رسالت کی قربانیوں کے ساتھ ساتھ قائدین کی استقامت کےمرہون منت ہے۔',
                   textDirection: TextDirection.rtl,
                   textAlign: TextAlign.justify,
                    style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 15),
                    ),
                )),
              ],
              onExpansionChanged: (bool expanded) {
                setState(() => _customTileExpanded = expanded);
              },
            ),
          ),
          const Directionality(
            textDirection: TextDirection.rtl,
            child: ExpansionTile(
              title: Text('تحریک کی بنیاد', style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 15),),
              controlAffinity: ListTileControlAffinity.leading,
              children: <Widget>[
                 Padding(
                   padding: EdgeInsets.symmetric(horizontal: 20),
                   child: Text('تحریک لبیک پاکستان(ٹی ایل پی) تحریکی طور پر معرض وجود آنے والی ایک سیاسی جماعت ہے، اس تحریک کی بنیاد کا سبب 29 فروری 2016ء کو حکومت پاکستان کی طرف سے سابق گورنر پنجاب گستاخ رسول آسیہ بی بی کے حمائتی اور ناموس رسالت کے قانون 295-Cکوکالا قانون سے تعبیر کرنے والے سلمان تاثیر کے قتل کی وجہ سےعاشق رسول فنا فی الرسول غازی ممتاز حسین قادری رحمتہ اللہ علیہ کو دی جانے والی پھانسی کی سزا کے بعد اگلے دن یکم(1) مارچ کو لیاقت باغ، راولپنڈی میں ہونے والی نماز جنازہ میں کثیر عاشقان رسول کا اجتماع بنا۔سلمان تاثیر نے آسیہ بی بی کا دفاع کرتے ہوئے اور توہین رسالت کے قوانین کے خلاف بحث کرتے ہوئے ایک سرخ لکیر(RED LINE) عبور کر لی تھی ، اسلامی نظریے اورآئین پاکستان کی نظر میں مارے جانے کا مستحق تھا۔پنجاب کے محکمہ پولیس میں ایک معمولی کانسٹیبل کی غیرت و حمیت نے یہ گورانہ کیا اور وقت کے گورنر کو اس کے منطقی انجام تک پہنچا دیا۔ ممتاز قادری کو گرفتار کر کے مقدمہ چلایا گیا۔ جب انہیں اکتوبر 2011 میں انسداد دہشت گردی کی عدالت نے موت کی سزا سنائی تو تمام عاشقان رسول غم و غصہ کا اظہار کر رہے تھے۔ اور پاکستان کے عدالتی نظام پر ایک سوالیہ نشان تھا کہ کیسے ایک عاشق رسول کو پھانسی دے دی گئی۔جب عدالتی کاروائی چل رہی تھی تو وکلاء کی ایک کثیر تعداد نے رضاکارانہ طور پر عدالت میں غازی ممتاز صاحب کی نمائندگی کی، اور ایک وقت میں کمرہ عدالت میں ان کے دفاع کے لیے 90 سے زیادہ وکلاء موجود تھے۔ جب اپیل کا عمل جاری تھا، کئی عاشقان مصطفیٰ اور مذہبی  گروپس سڑکوں پر نکل آئے تاکہ حکام کو قادری کی سزائے موت کو معطل کرنے پر مجبور کیا جائے۔ لیکن افسوس ایسا نہ ہو سکا،ایک اسلامی ملک میں ایک عاشق رسول کو دہشتگرد ،مجرم اور قاتل بنا کے پیش کیا گیا اور آخر کار فروری 2016 میں پھانسی دے دی گئی جو کہ آئین، قانون اور اسلام کے مطابق نہ تھا۔ ان کی نماز جنازہ راولپنڈی کے لیاقت باغ میں ادا کی گئی، جہاں صرف اور صرف لوگ تھے۔ نو (9)سال قبل اسی جگہ سابق وزیراعظم بے نظیر بھٹو کو قتل کر دیا گیا تھا۔  لاکھوں افراد نے فنا فی الرسول عاشق صادق غازی ممتاز حسین قادری شہید رحمتہ اللہ علیہ کو الوداع کرنے کے لیے لیاقت باغ کا رخ کیا ۔ اس تقریب میں شامل ہونے والے اوراسکو کور کرنے والے بہت سے لوگوں،نیشنل اور انٹرنیشنل میڈیا پرسنز اور رپورٹرز نے دلیل دی کہ یہ ملک پاکستان میں اب تک کے سب سے بڑے جنازوں میں سے ایک تھاحالانکہ پاکستان میں مکمل میڈیا بلیک آوٹ تھا۔ ایک اندازہ کے مطابق ساٹھ(60)لاکھ سے زائد غیرت و حمیت کے حامل افراد نے نمازجنازہ میں شرکت کی۔غازی ملک ممتاز حسین  قادری شہید کی پھانسی پاکستان میں ابھرتی ہوئی  تحریک کے لیے ایک اہم نکتہ تھی۔ کارکنوں اور رہنماؤں کے  گروپ نے غازی صاحب  کی پھانسی کے بعد مرکزی دھارے کی سیاست میں آنے کا فیصلہ کیا –تاکہ جو ملک اسلام کے نام پر قائم ہوا وہاں اسلامی نظام یعنی نظام ِمصطفی ٰکی بہار قائم ہو۔ قادری صاحب کی نماز جنازہ کا اہتمام تحریک لبیک یا رسول اللہ (TLYR) نے کیا، جو چار  تنظیموں کے اتحاد  پر مشتمل ایک جماعت تھی۔تحریک سیرتِ مصطفیٰ کی قیادت اشرف آصف جلالی صاحب نے کی اور عالمی تنظیم اہلسنت کی قیادت پیر افضل قادری صاحب نے کی جبکہ ثروت اعجاز قادری صاحب کی سربراہی میں سنی تحریک اور علامہ خادم حسین رضوی صاحب کی قیادت میں انجمن فدایانِ ختمِ نبوت شامل تھی۔تاہم تحریک لبیک یا رسول اللہ( TLYR )متحد نہ رہ سکی اورعلامہ  اشرف آصف جلالی صاحب  نے دیگر رہنماؤں سے اختلافات پیدا کر کے اس سے علیحدگی اختیار کر لی۔بعد ازاں تحریک لبیک پاکستان TLP بنائی گئی اور اس کی قیادت امیر المجاہدین کا لقب پانے والے علامہ خادم حسین رضوی صاحب  نے کی۔ انہوں نے خود کو ختم نبوت کی حرمت کے محافظ کے طور پر پیش کیا ۔ مساجد، مدارس ،خانقاہوں کے علاوہ مختلف شعبہ ہائے زندگی سے تعلق رکھنے والےاحباب اور خصوصاََ نوجوانوں (یوتھ)نے اسلامی نظام حکومت یعنی نظام مصطفیٰ کے قیام کےلئے جوق در جوق ٹی ایل پی میں شمولیت اختیار کی۔اس طرح نچلی سطح تک مہینوں کے اندرتنظیم نیٹ ورک قائم ہوا۔مزید برآں امیرالمجاہدین بابا جی کےاخلاص  کے ساتھ ساتھ نہایت سادہ  پرسوز اور  شعلہ بیان تقریروں کے ذریعےپورے ملک پاکستان خصوصاََپنجاب  اور سندھ میں  اکثریت کے درمیانے اور نچلے درمیانے شہری مراکز میں ایک بڑی اسٹریٹ فورس بن گئی۔اپنی مدد آپ کے تحت  کارکنوں اور عہدیداروں نے بھرپور مالی تعاون جاری رکھا،بعد ازاں ملک بھر  خصوصاََ لاہور و کراچی کے تاجر حضرات تحریک کی مالی اعانت کا ایک ذریعہ بن گئے۔ جس نے ٹی ایل پی کے ڈرامائی عروج کو ملک کے سب سے طاقتور سیاسی اور مذہبی قوت بنا دیا۔',
                   textDirection: TextDirection.rtl,
                   textAlign: TextAlign.justify,
                    style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 16),),
                 ),
              ],
            ),
          ),
           const Directionality(
            textDirection: TextDirection.rtl,
            child: ExpansionTile(
              title: Text('تحریک کے اغراض و مقاصد', style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 15),),
              controlAffinity: ListTileControlAffinity.leading,
              children: <Widget>[
                 Padding(
                   padding: EdgeInsets.symmetric(horizontal: 20),
                   child: Text('تحریک لبیک پاکستان تحریکی طور پر معرض وجود آنے والی ایک مذہبی سیاسی جماعت ہونے کے ساتھ ساتھ ایک ایسا پاکستان دیکھنا چاہتی ہے جہاں اللہ کے رسول صلی اللہ علیہ وآلہ وسلم کی عزت اور ناموس پہ کسی بھی قسم کا سمجھوتہ نہ ہو۔ٹی ایل پی  کا مقصد یہ ہے کہ پاکستان کا نظام عدل ہی نہیں بلکہ پاکستان کا مکمل نظام حکومت اسلام کے عین اصولوں کے مطابق ہو۔ایک ایسا پاکستان جہاں پر غازیان اسلام کو دہشتگرد نہ بنایا جائے، اور گستاخان رسول کےلئے کسی بھی قسم کا نرم گوشہ نہ رکھا جائے۔ ہمارا ماننا ہے کہ جب یہ ملک لاالہ اللہ کی بنیاد پر بنا ہے تو یہاں نظام بھی محمد رسول اللہ والا ہونا چاہئے۔یہی ہمارا منشور ہے ""اسلام ،پاکستان اور عوام""۔ ہمارا مقصد نہ کسی کو گرانا ہے اور نہ کسی کو اٹھانا ہے"" بس!حضور کے دین کو تخت پر لانا ہے""۔ آیا آیا دین آیا، آیا آیا دین آیا۔ ہم یہ جانتے ہیں کہ دین کو قائم کرنا ہر ایک پر فرض نہیں ہے لیکن دین کےلئے جدوجہد کرنا ہر کلمہ پڑھنے والے مسلمان (مرد اورعورت)پر فرض ہے۔ اسی جدوجہد کےپیشِ نظر تحریک لبیک پاکستان میدان عمل میں ہے۔',
                   textDirection: TextDirection.rtl,
                   textAlign: TextAlign.justify,
                    style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 16),),
                 ),
              ],
            ),
          ),
          const Directionality(
            textDirection: TextDirection.rtl,
            child: ExpansionTile(
              title: Text('ضمنی انتخابات 2017ءاور 2018ء', style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 15),),
              controlAffinity: ListTileControlAffinity.leading,
              children: <Widget>[
                 Padding(
                   padding: EdgeInsets.symmetric(horizontal: 20),
                   child: Text('نواز شریف کی نااہلی پر خالی ہونے والی حلقہ این اے۔120 کی نشست پر ہونے والے ضمنی انتخابات 17 ستمبر 2017ء میں پہلی بار انتخاب لڑا اور تیسری پوزیشن لی۔گلزار خان کی وفات پر خالی ہونے والی حلقہ این اے۔4 کی نشست پر ہونے والے ضمنی انتخابات 2017ء میں پانچویں پوزیشن حاصل کی۔جہانگیر ترین کی نااہلی پر خالی ہونے والی حلقہ این اے۔154 کی نشست پر ہونے والے ضمنی انتخابات 12 فروری 2018ء میں تیسری پوزیشن حاصل کی۔',
                   textDirection: TextDirection.rtl,
                   textAlign: TextAlign.justify,
                    style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 16),),
                 ),
              ],
            ),
          ),
          const Directionality(
            textDirection: TextDirection.rtl,
            child: ExpansionTile(
              title: Text('احتجاج اور دھرنے', style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 15),),
              controlAffinity: ListTileControlAffinity.leading,
              children: <Widget>[
                 Padding(
                   padding: EdgeInsets.symmetric(horizontal: 20),
                   child: Text('نومبر 2017 ءمیں، اٹک میں پیدا ہونے والے، لاہور میں مقیم تحریک لبیک پاکستان کے امیر  علامہ خادم حسین رضوی کی قیادت میں ہزاروں مظاہرین نے پاکستان کے دارالحکومت اسلام آباد جانے والے راستے کو فیض آباد کے مقام سے بند کر دیا کیوں کہ"  آئینی ترمیم "الیکشن بل" 2017ء میں ختم نبوت کے حوالہ سے "حلف نامہ" کے الفاظ کو بدل دیا گیا تھا۔ مظاہرین نے حکومت سے مطالبہ کیا ہے کہ وہ وزیر قانون زاہد حامد سے استعفیٰ لے۔ یہ حلف نامہ ختم نبوت سے متعلق تھا جو پاکستان میں سیاسی امیدوار پارلیمنٹ میں داخل ہونے کے لیے الیکشن لڑنے سے پہلے لیتے ہیں۔تحریک لبیک پاکستان اور تحریک لبیک یا رسول اللہ نے احتجاج شروع کیاجو الیکشن کمیشن میں رجسٹرڈ اایک سیاسی جماعت ہونے کے ناطے ان کا آئینی، قانونی اور جمہوری  حق تھانیز مذہبی سیاسی جماعت ہونے کے ناطے فرض تھا۔ ہونا تو یوں چاہئے تھا کہ اسلام کے نام پر معرض وجود میں آنی والی ایک مملکت خداداد  "اسلامی جمہوریہ پاکستان"میں ختم نبوت کے معاملہ پر ڈاکے ڈالنے والوں  کو بےنقاب کر کے قرار واقعی سزا دی جاتی الٹا  پر امن احتجاج کرنے والے مظاہرین پر حکومت نے بڑے پیمانے پرتشدد کرنا شروع کیا۔اور بہت سی گرفتاریاں عمل میں لانا شروع کر دیں۔ احتجاج اکیس (21 ) دن تک جاری رہا، اسلام آباد کے رہائشی مشکلات سے دوچار رہے کیونکہ مظاہرین اور قانون نافذ کرنے والے اہلکاروں کے درمیان سڑکوں پر جھڑپیں ہوتی رہیں۔ اس دوران میں تحریک کے سات (7)افراد شہید اور 200 سے زائد زخمی ہوئے۔  حکومت نے 25 نومبر کو ایک ناکام آپریشن کیا، جس کے بعد ملک بھر میں مظاہرے شروع ہو گئے اور حکومت مزید دباؤ میں آگئی، کئی شہروں اور شاہراہوں کو تاجدار ختم نبوت کے غلاموں  نے بند کر دیا اور ذرائع نقل و حمل متاثر ہوئی، آخر کار حکومت نے 27 نومبر کو مذاکرات کے بعد ایک معاہدے پر دستخط کیے، جس کے بعد زاہد حامد نے استعفیٰ دے دیا اور دھرنا ختم کر دیا گیا۔ جب کہ دوسری طرف لاہور میں کنز العلماء علامہ اشرف آصف جلالی صاحب نے دھرنا دیا تھا جو بعد میں کسی نتیجے پر نہیں پہنچا اور ختم کر دیا گیا تھا۔فیض آباد والا دھرنا اس لئے ختم کر دیا گیا کہ پاکستانی فوج کی جانب سے حکومت وقت کو یہ سمجھایا گیا کہ یہ جماعت طالبان القاعدہ یا دیگر عسکریت پسند گروہوں جیسی جماعت نہیں بلکہ ایک رجسٹرڈ سیاسی پارٹی ہے۔ وہ جو مطالبات کر رہے ہیں مسلم لیگ (ن) کی حکومت پر امن طریقے سےاحتجاج اور  دھرنے کو تشدد سے بچنے کے لیے سنبھالےاور مظاہرین کے جائز مطالبات فوری مانے جائیں کیونکہ "یہ قومی مفاد میں نہیں ہے۔"دھرنا اس وقت ختم ہوا جب فوج نے خود مظاہرین اور شریف حکومت کے درمیان کردار ادا کیا۔ مظاہرین کے مطالبے پر وزیراعظم نواز شریف  کو اپنے وزیر قانون زاہد حامد کو بھی چھوڑنا پڑا۔ پاکستان کی انٹر سروسز انٹیلی جنس (آئی ایس آئی) کے سابق سربراہ اور اس وقت آئی ایس آئی کے انسداد انٹیلی جنس ونگ کے ڈائریکٹر جنرل لیفٹیننٹ جنرل فیض حمید نے ثالث کے طور پر حکومت اور ٹی ایل پی کے درمیان معاہدے پر دستخط کیے۔معاہدے کے بعد جب مظاہرین منتشر ہونا شروع ہوئے تو سوشل میڈیا پر ایک ویڈیو وائرل ہوئی جس میں ایک سینئر فوجی اہلکار کو ہر ایک مظاہرین کو 1000 روپے تقسیم کرتے ہوئے دکھایا گیا تاکہ وہ اپنے آبائی شہروں کو واپس جا سکیں۔اگرچہ ٹی ایل پی نوازشریف کی حکومت کو گرانے میں ناکام رہی تھی، لیکن اس نے انہیں ایک ایسا دھچکا پہنچایا جس نے اقتدار پر وزیر اعظم کی گرفت کو نمایاں طور پر کمزور کر دیا اور اشارہ دیا کہ ٹی ایل پی اب ایک ایسی قوت ہے جو اسلامی ملک میں غیر اسلامی ایجنڈا کے تحت قوانین میں تبدیلی نہیں ہونے دے گی نیز پاکستان کی نظریاتی سرحدوں کو کسی صورت کمزور نہیں ہونے دے گی۔انشاء اللہ عزوجل ۔',
                   textDirection: TextDirection.rtl,
                   textAlign: TextAlign.justify,
                    style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 16),),
                 ),
              ],
            ),
          ),
          const Directionality(
            textDirection: TextDirection.rtl,
            child: ExpansionTile(
              title: Text('ہالینڈ میں کارٹون مقابلے اور آسیہ بی بی کی بریت', style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 15),),
              controlAffinity: ListTileControlAffinity.leading,
              children: <Widget>[
                 Padding(
                   padding: EdgeInsets.symmetric(horizontal: 20),
                   child: Text('ح2018ءمیں، اسلامو فوبک ڈچ قانون ساز گیرٹ ویلڈرز نے ہالینڈ میں گستاخانہ خاکوں کے مقابلے کا منصوبہ بنایا جس نے پوری دنیا کے مسلمانوں کو مشتعل کردیا۔ تاجدار ختم نبوت کی جسمانی تصویر کشی اسلام میں حرام ہے اور مسلمانوں کے لیے سخت ناگوارہونے کے ساتھ ساتھ بہت بڑی گستاخی تصور کی جاتی ہے۔ پاکستانی مشتعل تھے اور وزیراعظم عمران خان کی حکومت، جو ۲۰۱۸ کے انتخابات کے بعد اقتدار میں آئی تھی، نے ڈچ حکام کے ساتھ اپنا شدید احتجاج ریکارڈ کرایا لیکن امیرالمجاہدین حضرت خادم حسین رضوی نے یہاں  پاکستان میں وہیل چیئر پر ہونے کے باوجود ہالینڈ کے گستاخوں کی نیندیں حرام کر رکھی تھیں۔آپ  نے ایک بار پھر اپنے کارکنوں ،عہدیداروں اور ہمدردوں کو ہدایت کی کہ وہ خان کی حکومت کو ہالینڈ کے ساتھ سفارتی تعلقات منقطع کرنے پر مجبور کرنے کی کوشش میں سڑکوں پر آئیں۔ (2017) ءمیں ملکی سیاست پر کامیابی سے اثر انداز ہونے کے بعد،ٹی ایل پی( TLP) اب پاکستان کی خارجہ پالیسی پر بھی اپنی بھرپور پالیسی سٹیٹمنٹ دے رہی تھی۔گستاخ گیرٹ ویلڈرزنے اپنی نمائش تحریک لبیک پاکستان کے زیر اہتمام ایک تاریخی لانگ مارچ لاہور تا اسلام آباد  کے نتیجہ میں منسوخ کرتے ہوئے  خود اعلان کیا کہ وہ ایسا کوئی مقابلہ نہیں کریں گے۔ انہوں نے کہا کہ یہ فیصلہ "اسلامی تشدد کے متاثرین کے خطرے سے بچنے کے لیے کیا گیا ہے۔" ٹی ایل پی کی عالمی سطح پر گستاخان رسول کے خلاف یہ ایک بھرپور کامیابی تھی۔ جس پر اللہ کا جتنا شکر ادا کیا جائے اتنا کم ہے۔آخر کار یہ احتجاج نتیجہ خیز فیصلہ کے بعد اپنے اختتام کو پہنچا اور پی ٹی آئی(PTI) کی نئی نویلی حکومت نے کچھ سکون کا سانس لیا۔ لیکن یہ صرف طوفان سے پہلے کا سکون تھا۔ اکتوبر (2018) ءمیں پاکستان بھر میں تحریک نے ہر جگہ مظاہرے کرنے شروع کئے۔معاملہ زیادہ تب بگڑا جب سپریم کورٹ نے ایک سرٹیفائیڈ گستاخہ رسول مسیحی خاتون آسیہ بی بی کو بری کر دیا جسے (2010) میں توہین مذہب کے الزام میں سزائے موت سنائی گئی تھی اور جس کے دفاع کے لیے پنجاب کے گورنر سلمان تاثیر کو قتل کر دیا گیا تھا۔ ٹی ایل پی کے مظاہرین نے ملک بھر میں دھرنے دیئے اور ملک کے مختلف حصوں کو تعطل کا شکار کر دیا۔وزیر اعظم خان کی حکومت نے تحریک کے قائدین کے ساتھ گفت و شنید کی تو ملک میں جاری پرتشدد مظاہرے اس وقت ختم ہوئے جب ان کی حکومت نے(TLP) کو یقین دلایا کہ وہ مظاہرین کو بی بی کی بریت کو قانونی طور پر چیلنج کرنے سے نہیں روکے گی۔ تاہم افسوس صد افسوس !پاکستان کی سپریم کورٹ نے یہ اپیل مسترد کر دی تھی۔ اس کے بعدملعونہ  بی بی کو رہا کر دیا گیا اور تحریک انصاف نے فوری طور پرانہیں  اپنے خاندان کے ساتھ بیرون ملک پناہ حاصل کرنے کے لیے مکمل معاونت فراہم کی۔ مزید ظلم یہ کہ تحریک کے کارکنوں اور قائدین پر بد ترین کریک ڈاون شروع کر دیا۔ بہت سے علماء کرام اور سادات کرام کو پابند سلاسل کیا گیا۔ مرکزی قائدین اور تنظیمی عہدیداروں پر طرح طرح کے جھوٹے پرچے کاٹے گئے۔ اداروں کے ذریعے کارکنان کو ڈرایا دھمکایا گیا۔ چادر اور چاردیوری کا تقدس پامال کیا گیا۔ یہاں تک کہ ملکی اور غیر ملکی آقاوں کو خوش کرنے کےلئے اس ساری تحریک کے روح رواں بابا جی خادم حسین رضوی کو ان کے گھر سے گرفتارکر لیا گیا۔ 6 ماہ کےلئے ناجائز اور بے بنیاد الزامات کی بنیاد پر جیل میں رکھا گیا۔',
                   textDirection: TextDirection.rtl,
                   textAlign: TextAlign.justify,
                    style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 16),),
                 ),
              ],
            ),
          ),
           const Directionality(
            textDirection: TextDirection.rtl,
            child: ExpansionTile(
              title: Text('پاکستانی سیاست میں دھماکے دار انتخابی اینٹری', style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 15),),
              controlAffinity: ListTileControlAffinity.leading,
              children: <Widget>[
                 Padding(
                   padding: EdgeInsets.symmetric(horizontal: 20),
                   child: Text('تحریک لبیک پاکستان بھی ابتدائی مراحل پر تھی کہ اسے بیک وقت بہت سے مراحل کا سامنا تھا۔ایک طرف گستاخان رسول تو دوسری طرف انٹرنیشنل منفی قوتیں اور ان کے پاکستان میں سہولت کار ۔اس پر ظلم کی انتہا یہ کہ کچھ اپنوں نے بھی بیگانوں جیسا کردار ادا کیا۔ لیکن پھر بھی تمام نامساعد حالات کے باوجود بے سروسامانی کے عالم میں ٹی ایل پی نے 2018ء میں ہونے والے جنرل الیکشن میں بھرپور حصہ لینے کا اعلان کیا۔اس سے پہلے تحریک 2017ء اور 2018ء میں ضمنی انتخابات میں حصہ لے کر اپنی اینٹری کر چکی تھی ۔لیکن پاکستانی سیاست میں ایک دھماکے دار اینٹری 2018ء کے جنرل الیکشنز میں ہوئی۔اپنے تو اپنے بیگانے بھی اعتراف کرنے پر مجبور ہو گئے کہ ٹی ایل پی مذہبی ہونے کے ساتھ ساتھ ایک سیاسی  حقیقت ہے اور اس کا انکار نہیں کیا جا سکتا ۔TLP کی بڑھتی ہوئی سٹریٹ پاور کو 2018 کے عام انتخابات میں اس کی کامیابیوں سے تقویت ملی، جہاںاس جماعت نےتقریباً 2.2 ملین ووٹ حاصل کر کے پاکستان کی چوتھی،پنجاب اور سند ھ کی تیسری بڑی  سیاسی جماعت کے طور پر اپنا لوہا منوایا۔نیز قیام پاکستان سے اب تک جتنی بھی مذہبی تنظیمات تھیں تمام کے مجموعی ووٹوں سے بھی زیادہ ووٹ حاصل کئے۔شدید ترین دھاندلی جس پر تمام سیاسی جماعتیں متفق ہیں کہ باوجود اگرچہ پارٹی پارلیمنٹ میں کوئی نشست نہیں جیت سکی، لیکن اس نے کراچی میں اتنے ووٹ حاصل کیے کہ اپنے دو اراکین سندھ کی صوبائی اسمبلی میں بھیج سکے۔ پنجاب میں سخت مقابلہ کرنے والی نشستوں پرسرفہرست تھے۔ قومی اسمبلی میں مسلم لیگ (ن) کے مزید نشستیں جیتنے کے امکانات کو نقصان پہنچایا۔ الیکشن کمیشن آف پاکستان کے حاصل کردہ اعداد و شمار کے مطابق، موصول ہونے والے کل 2.2 ملین ووٹوں میں سے، TLP کو سابق وزیر اعظم شریف کے آبائی صوبےیعنی پنجاب  میں 1.9 ملین سے زیادہ ووٹ ملے۔تجزیہ سے پتہ چلتا ہے کہ ٹی ایل پی نے کم از کم 13 قومی اسمبلی کی نشستوں پرمسلم لیگ (ن) پارٹی کو شکست دینے میں اپنا کردار ادا کیا ہے۔اور پاکستانی سیاست کے بھرے بازار میں ایک دھماکے دارانتخابی  اینٹری کے ذریعے ہل چل مچا دی۔یہ نتیجہ تحریکی لوگوں کے لیے حیران کن نہیں تھابلکہ پریشان کن تھا کیونکہ انہوں نے ٹی ایل پی کی بھرپورانتخابی مہم میں حصہ لیا تھا۔نتائج کو حقیقی معنوں میں درست نہیں کہا جا سکتا تھا۔ووٹ اس سے کہیں زیادہ تھے جو کہ بتائے نہیں جا رہے تھے۔ بابا جی خادم حسین رضوی صاحب نے تواتر سے اپنی جماعت کو ناموس رسالت اور ختم نبوت کے محافظ کے طور پر پیش کیا تھا۔اور صرف 6 ماہ کی جماعت کاالیکشن میں ووٹوں کی تعداد عوام پاکستان کا تحریک لبیک پاکستان پر بھرپور اعتماد کا مظہر تھا۔',
                   textDirection: TextDirection.rtl,
                   textAlign: TextAlign.justify,
                    style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 16),),
                 ),
              ],
            ),
          ),
           const Directionality(
            textDirection: TextDirection.rtl,
            child: ExpansionTile(
              title: Text('فرانس کے خلاف احتجاج اور مظاہرے', style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 15),),
              controlAffinity: ListTileControlAffinity.leading,
              children: <Widget>[
                 Padding(
                   padding: EdgeInsets.symmetric(horizontal: 20),
                   child: Text('نومبر 2020 میں، ٹی ایل پی کے امیر با با جی علامہ خادم حسین رضوی صاحب نے ایک بار پھر اپنے کارکنان کو اسلام آباد کی طرف کے جانے کے لئے اعلان کیا۔لیکن اس دفعہ معاملہ انٹرنیشنل گستاخی سے متعلق تھا۔دنیا بھر کے علاوہ  پاکستان میں بھی تمام عاشقان مصطفیٰ  کا غصہ اس وقت بڑھ گیا جب فرانسیسی صدر ایمانوئل میکرون نے اپنی کلاس میں گستاخانہ خاکے دکھانے والے تاریخ کے استاد کا سر قلم کرنے کے بعد حضور نبی پاک محمد مصطفیٰ صلی اللہ علیہ وسلم  کی تصویر کشی کرنے والے "کارٹون" نہ چھوڑنے کے عزم کا اظہار کیا۔مزید گستاخی پر گستاخی یہ کہ پیرس میں ایک میگزین نے پیغمبر اسلام کے گستاخانہ خاکے شائع کئے تو فرانس کے  صدر نے نہ صرف ان کی سرپرستی کی بلکہ پیغمبر اسلام کے گستاخانہ خاکے فرانس کی سرکاری بلڈنگز پر بھی شائع کئے۔تحریک لبیک پاکستان کا موقف یہ تھا کہ بڑے بڑے گستاخ آئے ہیں اور انہوں نے گستاخی کی ہے لیکن تاریخ میں ایسا پہلی دفعہ ہوا ہے کہ ایک ملک کے سربراہ نے نہ صرف گستاخی کرنے والے کی  کھلم کھلا حمایت کی ،اس کوسرکاری اعزاز سے بخشا اور پھر خود سرکاری سطح پر پیغمبر اسلام کی گستاخی کا مرتکب ہوا ہے۔ لہٰذا اسلام کے نام پر قائم ہونے والے اسلامی جمہوریہ پاکستان اور ہماری ایٹمی طاقت کی حامل  اسلامی فوج پر واجب ہے کہ سرکاری سطح پر اس کے خلاف جہاد کا اعلان کرے۔اور اگر یہ نہیں کرسکتی تو کم از کم عمران خان یعنی پاکستان تحریک انصاف (پی ٹی آئی )کی حکومت کو چاہئے کہ فرانس کی  حکومت کے ساتھ سفارتی تعلقات منقطع کرے۔فرانسیسی مصنوعات کا بائیکاٹ کرے۔اپنا سفیر واپس بلائے اور یہاں پاکستان میں موجود فرانسیسی سفیر کو ملک بدر کیا جائے۔تاکہ اقوام عالم کو معلوم ہو سکے کہ ہمیں اپنے آقا و مولا تاجدار ختم نبوت کی عزت اور ناموس سے بڑھ کر کچھ بھی عزیز نہیں۔مگر افسوس صد افسوس!تحریک انصاف کی ریاست مدینہ کی دعویدار حکومت نے لبرلز اور مغربی لابی کو خوش کرنے کے لئے فرانس کے خلاف احتجاج کرنے والوں پر ظلم کے پہاڑ توڑ دئے۔اسلام آباد کی سڑک میدان جنگ بن گئی اور قانون نافذ کرنے والے اہلکاروں کی جانب سے لانگ مارچ  کو اسلام آباد پہنچنے سے روکنے کی ہر ممکن  کوشش کی گئی۔ اس سلسلہ میں راولپنڈی میں ہونے والی  جھڑپوں میں متعدد پولیس اہلکار اور مظاہرین زخمی ہو ئے  لیکن طاقت کے اس بے جا استعمال نے مظاہرین کو مزید مشتعل کر دیا اور حکومت کو بالآخر پیچھےہٹنا پڑا ۔ٹی ایل پی کے ساتھ مذاکرات کے بعد حکومت وقت کو ایک معاہدہ کرنا پڑا ۔ اس بارمعاہدہ پر حکومتی وزراء نےدستخط کیے۔معاہدہ اس بات پر طے پایا کہ پی ٹی آئی کی حکومت پاکستان سے فرانسیسی سفیر کی بے دخلی پر بحث کے لیے پارلیمنٹ میں ایک قرارداد پیش کرے گی۔ معاہدے میں مزید کہا گیا کہ خان کی حکومت فرانس میں سفیر تعینات نہیں کرے گی اور ملک میں تمام فرانسیسی مصنوعات کا بائیکاٹ کیا جائے گا۔',
                   textDirection: TextDirection.rtl,
                   textAlign: TextAlign.justify,
                    style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 16),),
                 ),
              ],
            ),
          ),
           const Directionality(
            textDirection: TextDirection.rtl,
            child: ExpansionTile(
              title: Text('امیرالمجاہدین کا وصال با کمال اورتاریخی جنازہ', style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 15),),
              controlAffinity: ListTileControlAffinity.leading,
              children: <Widget>[
                 Padding(
                   padding: EdgeInsets.symmetric(horizontal: 20),
                   child: Text('فرانس کے خلاف جو تاریخی لانگ مارچ لاہور سے شروع ہوا اس کی قیادت علامہ خادم حسین رضوی کی بجائے علامہ سعد حسین رضوی صاحب نے کی کیونکہ بابا جی کی طبیعت بہت ناساز تھی۔ انہیں بہت تیز بخار تھا۔عمران خان حکومت سے معاہدہ طے پا جانے کے بعد فیض آباد میں آخری تقریر میں بابا جی کی  طبیعت کی ناسازی کا اندازہ لگایا جا سکتا ہے۔اس وقت انہیں 104بخار تھا۔لیکن پھر بھی آپ کارکنان سے خطاب فرمارہے تھے۔ وہ ایک تاریخی اور یادگار خطاب بن گیا۔ہر طرف سناٹا چھا گیا اور رقت آمیز مناظر دیکھنے کو ملے ۔خیرٹی ایل پی کے رہنما 17 نومبر کے معاہدے کے بعد گھر واپس چلے گئے، فرانس مخالف ریلی کے ختم ہونے کے صرف دو دن بعد لاہورمیں بابا جی کی طبیعت بہت بگڑ گئی انہیں ہسپتال لے جا یا گیا۔بعد میں یہ اطلاع لاکھوں افراد کے لئے ایک پہاڑ بن کے گری کہ کروڑوں دلوں کی دھڑکن اور لاکھوں دلوں کو عشق مصطفیٰ کی شمع سے روشن کر دینے والے، بھٹکے ہوئے نوجوانوں کو ایک منزل دکھانے والےایک عظیم لیڈر  شیخ الحدیث والتفسیر امام عاشقاں قبلہ امیرالمجاہدین حضرت علامہ مولانا حافظ خادم حسین رضوی انتقال کر گئے ہیں۔ان کا وصال باکمال ہو گیا۔ ایک عاشق اپنی منزل کو روانہ ہو گیا۔ اس دن کسی نے کیا خوب کہا کہ تم فرانس کا سفیر تو واپس نہ بھیج سکے لیکن آج نبی پاک نے اپنا سفیر اپنے پاس  بلا لیا۔تین دن تک لوگ آپ کی زیارت کرتے رہے۔لحد میں اتارتے وقت ان کے چہرہ مبارک پر مسکراہٹ دیکھی جا سکتی تھی۔ لاہور کے تاریخی مینارِ پاکستان پر لاکھوں افراد نے امیرالمجاہدین کے تاریخی جنازے میں شرکت کی ۔بی بی سی کی رپورٹ کے مطابق ایک کروڑ سے زائد افراد پر مشتمل یہ اجتماع تھا۔یہ وہی تاریخی جگہ ہے جہاں پر علامہ اقبال نے دو قومی نظریہ پیش کیا اور  جہاں 1940 میں قرارداد پاکستان پر دستخط کیے گئے تھے ۔امیرا لمجاہدین کے وصال باکمال پر پاکستان کی سویلین اور عسکری قیادت بشمول وزیراعظم  اور چیف آف آرمی سٹاف (COAS) نے بھی  تعزیتی پیغامات جاری کئے۔',
                   textDirection: TextDirection.rtl,
                   textAlign: TextAlign.justify,
                    style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 16),),
                 ),
              ],
            ),
          ),
           const Directionality(
            textDirection: TextDirection.rtl,
            child: ExpansionTile(
              title: Text('تحریک کانیا امیر۔۔۔علامہ سعد حسین رضوی', style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 15),),
              controlAffinity: ListTileControlAffinity.leading,
              children: <Widget>[
                 Padding(
                   padding: EdgeInsets.symmetric(horizontal: 20),
                   child: Text('بابا جی کے وصال باکمال کے بعد اب سوال یہ تھا کہ ٹی ایل پی کا اگلاامیر کون ہوگا؟مختلف چہ مگوئیاں اور قیاس آرائیاں شروع ہو گئیں۔ کیونکہ علامہ خادم حسین رضوی کی ایک کرشماتی شخصیت اور خطبات دینے کا ایک جارحانہ منفرد انداز تھا جس نے انہیں توجہ کا مرکز بنا دیاتھا۔ ان مہارتوں کے بغیر، بہت سے لوگوں کا خیال تھا کہ ٹی ایل پی  اپنے لاکھوں پیروکاروں کی توجہ برقرار رکھنے کی اپنی صلاحیت کھو سکتی ہے اور پاکستان کی سیاسی اور عسکری اشرافیہ کے لیے کوئی مسئلہ نہیں بن سکتی۔تمام تر سوالات اور قیاس آرائیوں کا ایک جواب تھا۔تحریک کا نیا امیر۔۔۔ 26 سالہ نوجوان علامہ سعد حسین رضوی بن علامہ  خادم حسین رضوی۔یہ انتخاب کوئی موروثیت کی بنیاد نہیں بلکہ بابا جی کی ترتیب دی ہوئی18 رکنی  مرکزی مجلس شوریٰ(کونسل)کے متفقہ فیصلہ کی بنیاد پر ہوا۔اور قائد محترم کو میرٹ، ان کی قابلیت،دیانت ، ذہانت  اور تحریک کے مفاد کو مدنظر رکھتے ہوئے کیا گیا۔بعد ازاں ثابت ہوا کہ یہ درست فیصلہ تھا۔ سعد حسین رضوی عالم دین ہونے کے ساتھ ساتھ ایک بہترین مقرر ،مدبر،مفکرلیڈر اور بالغ نظر سیاست دان ہیں',
                   textDirection: TextDirection.rtl,
                   textAlign: TextAlign.justify,
                    style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 16),),
                 ),
              ],
            ),
          ),
           const Directionality(
            textDirection: TextDirection.rtl,
            child: ExpansionTile(
              title: Text('سعادتوں والے سعد حسین رضوی کی سیاست', style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 15),),
              controlAffinity: ListTileControlAffinity.leading,
              children: <Widget>[
                 Padding(
                   padding: EdgeInsets.symmetric(horizontal: 20),
                   child: Text('اپریل 2021 میں، ٹی ایل پی کے نئے امیر علامہ سعد حسین رضوی نے فرانس مخالف مظاہروں کے ایک اور دور کی منصوبہ بندی کی، اور یہ دعویٰ کیا کہ عمران  خان کی حکومت نے فرانسیسی سفیر کو ملک بدر کرنے کا اپنا وعدہ پورا نہیں کیا۔ہم کوئی نیا مطالبہ نہیں کر رہے صرف اتنا کہہ رہے ہیں کہ جو وعدہ خان صاحب نے تحریک لبیک پاکستان سے کیا کہ حکومت پاکستان سے فرانسیسی سفیر کی بے دخلی پر بحث کے لیے پارلیمنٹ میں ایک قرارداد پیش کرے گی۔ معاہدے میں مزید کہا گیا کہ خان کی حکومت فرانس میں سفیر تعینات نہیں کرے گی اور ملک میں تمام فرانسیسی مصنوعات کا بائیکاٹ کیا جائے گا۔صرف اس معاہدے کو پورا کیا جائے۔ اب ہونا تو یوں چاہئے تھا کہ حکومت ایک جائز مطالبہ کے عوض جو وعدہ کر چکی تھی اس کو پورا کرتی الٹا ایک مرتبہ پھر ریاست مدینہ کی دعویدار حکومت نے پیشگی اقدام کے طور پرسعد رضوی صاحب کو گرفتار کر لیا۔جو کہ غیر قانونی اور غیر آئینی ہونے کے ساتھ ساتھ غیر جمہوری رویہ تھا۔ جب پوچھا گیا سعد رضوی کا جرم کیا ہے۔کیوں گرفتار کیا۔؟وہ جی ہمیں خطرہ تھا کہ سعد رضوی ایسے کر سکتا ہے ویسے کر سکتا ہے۔دراصل انہیں امید تھی کہ یہ گرفتاری فرانس کے خلاف احتجاج کو منظم کرنے کی صلاحیت کو کمزور کر دے گی۔ سعد رضوی ابھی نیا نیا لیڈر بنا ہے۔ بابا جی کی اور بات تھی وغیرہ وغیرہ۔تو اس نئے نویلے امیر اور لیڈر کو یہیں پر کچل دو۔ تحریک کمزور پڑ جائے گی۔ پھر کہاں کا معاہدہ اور کہاں کا وعدہ ۔یہ سب کچھ بدنیتی پر مبنی ایک پلان کا حصہ تھا ۔پہلے حکومت نے ٹی ایل پی سے معاہدہ کر لیا لیکن جب دیکھا کہ اس پر عمل نہیں کیا جا سکتا اگر ایسا کیا گیا تو حکومت کا حساب کتاب فرانس کے ساتھ ایک سفارتی بحران کے خطرات سے بھی دوچار ہو سکتا ہے۔ ؟ ملک یورپی یونین کی حمایت سے محروم ہو سکتا ہے؟ایف اے ٹی ایف کا بھی معاملہ ہےجس کے نتیجے میں ترجیحی تجارتی رسائی سے دستبرداری اور پہلے سے متزلزل معیشت کے لیے اہم مالی نقصانات ہو سکتے ہیں۔وغیرہ وغیرہ۔جیسے ہی سعد رضوی کی گرفتاری کی خبر ٹیلی ویژن چینلز پر آئی، ٹی ایل پی کے حامی ملک بھر کی سڑکوں پر جمع ہونا شروع ہوگئے۔ حکومت نے ٹی ایل پی کے سامنے نہ جھکنے کا فیصلہ کیا اور ملک کے انسداد دہشت گردی کے قوانین کے تحت اس پر پابندی لگانے کے لیے تیزی سے حرکت میں آئی اور اس کے رہنماؤں کو بھی حراست میں لے لیا۔ لیکن اس سارے معاملے نے ٹی ایل پی کے حامیوں کو مزید مشتعل کیا۔وجہ یہ تھی ایک تو معاہدہ کیا۔ دوسرا جب اپنا وعدہ پورا کرنے کی باری آئی تو جماعت کے امیر کو بلاوجہ گرفتار کر لیا۔  قائدین کے خلاف فورتھ شیڈول اور جھوٹے پرچے کاٹ دیےگئے اور چوتھا نہتےکارکنان پر  بلاوجہ شیلنگ اور تشدد کیا گیا۔ آخر ہمارا جرم کیا ہے۔ ؟22 اکتوبر کو TLP کے ہزاروں مظاہرین نے حکومت کو فرانسیسی حکومت کے ساتھ سفارتی تعلقات منقطع کرنے پر مجبور کرنے کی ایک اور کوشش میں اسلام آباد کی طرف مارچ شروع کیا۔اس دفعہ یہ مارچ جماعت کے امیرحافظ سعد حسین رضوی کے بغیر تھا کیونکہ انہیں کئی ماہ سے نظر بندی کے پیش نظر جیل میں رکھا گیا تھا۔البتہ اس دفعہ مارچ حافط انس حسین رضوی کی قیادت میں تھا۔ ساتھ چند ایک شوریٰ کے ارکان تھے باقی بہت سے جیلوں میں تھے۔ لیکن مارچ میں سے کسی نے بھی سعد رضوی کی رہائی کا مطالبہ نہ کیا تھا صرف ایک ہی مطالبہ تھا کہ اپنے معاہدہ کو پورا کرو۔ مارچ پر  ٹی ایل پی نے دلیل دی کہ حکومت فرانس کے سفیر کو پاکستان سے نکالنے اور اپنے سابقہ معاہدوں پر عمل کرنے میں ناکام رہی ہے۔ حکومت نے گروپوں کو مذاکرات میں شامل کرنے کی کوشش کی لیکن کوئی پیش رفت نہیں ہوئی۔ پولیس کو ابتدائی طور پر مظاہرین کو اسلام آباد پہنچنے سے روکنے کا حکم دیا گیا تھا، جس کے نتیجے میں پنجاب کی سڑکوں پر پرتشدد جھڑپوں میں پولیس اہلکاروں سمیت متعدد تحریکی افراد شہید ہوئے۔جرم کیا تھا اپنے معاہدے پر عملدرآمد کے لئے احتجاج کر رہے تھے۔اسلام آباد میں، حکومت کے اندر کئی ذرائع نے انکشاف کیا کہ وزیر اعظم عمران خانٹی ایل پی کو رعایت دینے کے موڈ میں نہیں تھے کیونکہ ان کا خیال تھا کہ یہ گروپ اپنے پرتشدد نظریے کے ذریعے دنیا بھر میں پاکستان اور اسلام کی شبیہہ کو نقصان پہنچا رہا ہے۔منافقانہ رویہ کی انتہا یہ کہ ایک طرف وعدہ خلافی کر کے ٹی ایل پی کو اشتعال دلا رہے ہیں اور دوسری طرف ٹی ایل پی پاکستان اور اسلام کی شناخت کو نقصان پہنچا رہی ہے۔اسے دہشتگر د جماعت قرار دے کر پابندی کا سوچا جا رہا تھا۔ 29 اکتوبر کو خان نے اپنی قومی سلامتی کمیٹی کا اجلاس بلایا، جس میں سی او ایس جنرل باجوہ اور آئی ایس آئی کے سربراہ جنرل فیض سمیت سویلین اور فوجی رہنماؤں نے شرکت کی۔ فیصلہ واضح تھا: پاکستان اب ٹی ایل پی کو ریاست کی رٹ کو چیلنج کرنے کی اجازت نہیں دے گا۔خان کی کابینہ کے وزراء بھی ٹی ایل پی پر تنقید کرتے تھے۔ ملک کے وزیر اطلاعات فواد چوہدری نے ٹی ایل پی کو عسکریت پسند تنظیم قرار دیتے ہوئے کہا کہ پاکستانی ریاست اس گروپ کے ساتھ ویسا ہی سلوک کرے گی جیسا اس نے تحریک طالبان پاکستان (پاکستانی طالبان جسے ٹی ٹی پی بھی کہا جاتا ہے) یا اسامہ کے ساتھ کیا تھا،  بن لادن کی القاعدہ ۔یہ سب کچھ کہنے کو تو آسان تھا لیکن کرنے میں نہایت ہی مشکل ۔ سعادتوں والے سعد حسین رضوی نے جیل میں رہ کر ایسی سیاست کی کہ شاید جیل سے باہر رہ کر نہ کر پاتے۔ انہوں نے حکومت کی بدنیتی عوام پاکستان پر واضح کر دی۔ اور لوگوں  پر ریاست مدینہ بنانے والے جھوٹے دعویدار کی حقیقت سے پردہ چاک کر دیا۔ نیز تمام سیاسی اور دیگر مذہبی سیاست کے کھلاڑیوں ناموس رسالت کے معاملہ میں کلین بولڈ کر دیا۔   جیسے ہی ملک کے باقی حصوں کو جلد ہی پتہ چلاکہ جماعت پر پابندی بھی سعد حسین رضوی اور اس کی جماعت ٹی ایل پی کے ارادوں کو متزلزل نہ کر سکی اور حکومت کے تیز الفاظ کھوکھلے ہوگئےہیں۔ ہر طرف سے لعن تعن ہو رہی ہے۔ پیمرا کی پابندی بھی کچھ کام نہیں آرہی ہے۔ لاکھوں عاشقان مصطفیٰ کا سمندر اسلام آباد کی طرف رواں دواں ہے۔ ابھی تو ایک سفیر کا معاملہ ہے لیکن کہیں ایسا نہ ہو کہ حکومت کا معاملہ ہاتھوں سے نکل جائے راتوں رات  ٹی ایل پی کے 26 سالہ نوجوان امیر سعد حسین رضوی کو خفیہ طور پر لاہور سے اسلام آباد حکومت سے مذاکرات کرنے کے لیے لے جایا گیا جہاں امیر جماعت  کو ایک سرکاری آرام گاہ میں رکھا گیا ۔سعادتوں والے سعد حسین رضوی کی سیاست اور استقامت کی بدولت جلد ہی  اسلام آباد کی بیان بازی بدلنا شروع ہو گئی، وزراء نے اس بات کی تصدیق کی کہ وہ تحریک کے امیر اور قائدین سے بات کر رہے ہیں جس کا مقصد مارچ  کو دارالحکومت تک پہنچنے سے پہلے ہی ختم کرنا ہے۔ ٹی ایل پی کے رہنماؤں اور حکومتی وزراء کے درمیان کئی گھنٹے کی بات چیت ہوئی اور رپورٹس یہ بتانے لگیں کہ ٹی ایل پی کے ساتھ ایک اور معاہدہ طے پا گیا ہے۔لیکن اس دفعہ یہ معاہدہ خفیہ تھا اور کسی کو بھی اس بارے بات کرنے کی اجازت نہ تھی کیونکہ چیف آف آرمی سٹاف جنرل قمر جاوید باجوہ کی مداخلت سے یہ کامیابی ممکن ہوئی۔ جنرل باجوہ نے کراچی میں دو(2) طاقتور اور قابل احترام علماء مفتی منیب الرحمان صاحب اور حضرت مولانا بشیر فاروقی صاحب  سے ملاقات کی تھی۔ دونوں افراد نے آرمی چیف سے بحران کے بارے میں بات کی اور بعد میں تصدیق کی کہ جنرل باجوہ نے تعطل کو ختم کرنے میں اہم کردار ادا کیا۔ فوج نے ٹی ایل پی اور حکومت کے درمیان مذاکرات میں اپنے کردار کا نہ تو اعتراف کیا ہے اور نہ ہی تردید کی ہے۔ ملاقات کے صرف ایک دن بعد، مفتی منیب الرحمٰن صاحب ، ٹی ایل پی کے رہنما، اورحکومتی  وزیر 31 اکتوبر کو اسلام آباد میں میڈیا کے سامنے پیش ہوئے اور اعلان کیا کہ دونوں فریق ایک خفیہ معاہدہ کر چکے ہیں۔ اس خفیہ معاہدے کے بعد، پاکستان نے ٹی ایل پی پر عائد پابندی ختم کر دی اورجماعت کے مرکزی امیر حافظ  سعد حسین رضوی کو نومبر 2021 میں جیل سے رہا کر دیاجائے گا',
                   textDirection: TextDirection.rtl,
                   textAlign: TextAlign.justify,
                    style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 16),),
                 ),
              ],
            ),
          ),
           const Directionality(
            textDirection: TextDirection.rtl,
            child: ExpansionTile(
              title: Text('اب آئی آئی TLP۔۔اب چھائی چھائیTLP', style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 15),),
              controlAffinity: ListTileControlAffinity.leading,
              children: <Widget>[
                 Padding(
                   padding: EdgeInsets.symmetric(horizontal: 20),
                   child: Text('2023 کے عام انتخابات گرما گرم لڑے جائیں گے اور کوئی بھی بڑی سیاسی جماعت TLP اور اس کے لاکھوں ووٹروں کا مقابلہ کرنے کی متحمل نہیں ہو سکتی۔اس کا مطلب ہے کہ ٹی ایل پی ایک بار پھر بغیر کسی پابندی کے الیکشن لڑنے کے لیے آزاد ہے اور آنے والے عام انتخابات میں پاور بروکر (POWER BROKER)کے طور پر ابھرنے کا امکان ہے۔ پچھلی حکومتوں کی طرح پی ٹی آئی  حکومت نے بھی اپنی جان چھڑاتے ہوئے اس تحریک اور اس کے کارکنان کو مزید مشتعل نہ کرنے کا فیصلہ کیا ،  یہ فیصلہ بڑی حد تک انتخابی مفادات پر مبنی ہے۔نتیجہ یہ نکلا کہ ٹی ایل پی نے سیاسی سرگرمیاں دوبارہ سے  شروع کر دی ہیں اور ایسا لگتا ہے کہ اس جماعت کے 26 سالہ نوجوان رہنمااور امیر  نے 2023 ء میں ہونے والے اگلے انتخابات کی تیاری شروع کر دی ہے۔جیل سے رہا ہونے کے بعد  لاہور میں بابا جی خادم حسین رضوی نورا للہ مرقدہ کے پہلے سالانہ عرس پاک کی تقریبات  کے تیسرے روز  سعد رضوی نے اپنے کارکنان ، ذمہ داران اور عوام الناس کےلاکھوں کے اجتماع سے بات کرتے ہوئے کہا ہم نے ناموس رسالت کے مسئلہ پر کوئی سودا بازی نہیں کی۔ آپ نے ہم پر جو اعتماد کیا اس کا بھرپور دفاع کیا۔جیلیں برداشت کیں ۔جماعت کلعدم ہوئی ۔ لیکن آپ نے دیکھا یہاں پر پارلیمنٹ میں ایسے لوگ بیٹھے ہیں جو ناموس رسالت کے مسئلے میں سیریس نہیں ہیں۔ آپ سے گذارش ہے کہ وہ 2023 کے انتخابات میں ان کی جماعت کو ووٹ دیں۔ انہوں نے جماعت کا کلعدم ہونا اور دوبارہ سٹیٹس کا بحال ہونا اپنی جماعت کے اخلاص کی نشانی قرار دیا۔ انہوں نے فرمایا "اگلے انتخابات کے دوران بیلٹ باکسز خالی نہیں رہنے چاہئیں"۔سعد رضوی اب ناتجربہ کار لیڈر نہیں لگتے۔ جسے نہ صرف ان کے حامی بلکہ دیگر سیاسی جماعتوں کے رہنما بھی پسند کرتے ہیں۔سعد رضوی کی بالغ نظر سیاست نے حکومت کو TLP پر پابندی ختم کرنے کے ساتھ ساتھ انہیں جیل سے رہا کرنے پر مجبور کرنے کی صلاحیت نے اس تحریک کے لیےایک نیا جوش اور ولولہ دیا ہے۔سونے پر سہاگہ یہ کہ ناموس رسالت اور ختم نبوت پر کسی بھی صورت میں کمپرومائز نہ کرنے کی صورت اور سعد رضوی کی قائدانہ صلاحیتوں کی بدولت اب تحریک لبیک پاکستان ایک اہم اسٹیک ہولڈر کے طور پر دیکھی جا رہی ہے۔ بہت سے جماعتیں ٹی ایل پی سے اتحاد کرنا چاہتی ہیں۔ لیکن قائد محترم مرشد محترم جانم سلطانم سے فرما دیا ہےکہ ہم نظریہ پرست لوگ ہیں ۔ اور ہمارا نظریہ برائے فروخت نہیں ۔ہاں اگر کوئی ہمارے نظریہ پر آتا ہے تو وہ ہمارے پاس کیا آئے گا ہم اس کے پیچھے چلنے کو تیار ہیں۔ آخر میں یہ کہنا غلط نہ ہو گا کہ اب آئی آئیTLP ۔۔۔اب چھائی چھائیTLP ',
                   textDirection: TextDirection.rtl,
                   textAlign: TextAlign.justify,
                    style: TextStyle(fontFamily: "NotoNastaliqUrdu", fontSize: 16),),
                 ),
              ],
            ),
          ),
          
        ],),
      ),
    );
  }
}