var items = [
  'پنجاب',
  'سندھ',
  'بلوچستان',
  'خیبر پختونخوا',
  'گلگت بلتستان',
  'آزاد جموں و کشمیر',
];

var bloodgrps = ['O+', 'O-', 'A+', 'B+', 'AB+', 'A-', 'B-', 'AB-'];

var profession = [
  'سرکاری',
  'پرائیوٹ',
  'کاروبار',
  'ملازمت',
];

var gender = [
  'میل',
  'فی میل',
  'ٹرانس جینڈر',
  'بتانا نہیں چاہتے',
];

List zone = [
  "کےپی کے زون 1",
  "کےپی کے زون 2",
  "کے پی کے زون3",
  "شمالی پنجاب",
  "جنوبی پنجاب",
  "وسطی پنجاب",
  "زون صوبہ سندھ",
  "زون صوبہ بلوچستان",
  "زون آزادکشمیر",
  "زون گلگت بلتستان",
];
